<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <title>Привет мир!</title>
</head>
<body>
    <?php

        // 1. Целочисленный (анг. Integer)
        // Целые числа от -2147483648 до 2147483647
        $i = 27;

        // 2. С плавающей точкой (анг. Double)
        // Дробные числа с очень большой точностью (вместо знака "," используется знак ".")
        $d = 10.56;

        // 3. Строковый (анг. String)
        // Строки текста взятые в двойные кавычки
        $s = "Привет мир!";

        // 4. Логический (анг. Boolean)
        // Имеет два значение "истина" (анг. true или 1) и "ложь" (false или 0)
        $l = true;

        // 5. Пустой (анг. Null)
        // Не содержит никакого значения
        $n = NULL;

    ?>
</body>
</html>